Revit 2027 API
LineLightShape Class
 This class encapsulates a line light shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightShape
 Autodesk.Revit.DB.Lighting.LineLightShape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LineLightShape : LightShape
Public Class LineLightShape
	Inherits LightShape
public ref class LineLightShape : public LightShape
type LineLightShape =
    class
        inherit LightShape
    end
The LineLightShape type exposes the following members.
Constructors
Name | Description
LineLightShape() |  Creates a line light shape object with 2.0' emit length.
LineLightShape(Double) |  Creates a line light shape object with the given emit length.
LineLightShape(LineLightShape) |  Creates a copy of the given line light shape
Top
Properties
Name | Description
EmitLength |  The emit length.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from LightShape)
Top
Methods
Name | Description
Clone |  Creates a copy of the LightShape derived object.
(Inherited from LightShape)
Dispose
(Inherited from LightShape)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace